In [3]:
import json
import pandas as pd
import numpy as np

In [4]:
with open('nconsts_dict_J_0_10000.json', 'r') as nconsts_1:
    file_1 = nconsts_1.read()
json_1 = json.loads(file_1)

In [5]:
len(json_1.keys())

10000

In [6]:
json_1['nm0005877']

[{'adult': False,
  'gender': 2,
  'name': 'William V. Skall',
  'id': 17668,
  'known_for': [{'id': 1580,
    'video': False,
    'vote_count': 1363,
    'vote_average': 8.0,
    'title': 'Rope',
    'release_date': '1948-08-26',
    'original_language': 'en',
    'original_title': 'Rope',
    'genre_ids': [80, 53],
    'backdrop_path': '/81LX4wktTXWEXjLNlkHTmJm7tRu.jpg',
    'adult': False,
    'overview': 'Two men attempt to prove they committed the perfect crime by hosting a dinner party after strangling their former classmate to death.',
    'poster_path': '/tJlmMbaleBT8IwuidgI0ZvlLbWA.jpg',
    'popularity': 10.48,
    'media_type': 'movie'},
   {'adult': False,
    'backdrop_path': '/goyLlBUlfZwbKIJFvPbRmpkKYZ.jpg',
    'genre_ids': [18, 36, 10749],
    'id': 11620,
    'original_language': 'en',
    'original_title': 'Quo Vadis',
    'overview': "Set against the back drop of Rome in crisis, General Marcus Vinicius returns to the city from the battle fields and falls in love with a Christian woman, Lygia. Caught in the grip of insanity, Nero's atrocities become more extreme and he burns Rome, laying the blame on the Christians. Vinicius races to save Lygia from the wrath of Nero as the empire of Rome collapses around them.",
    'poster_path': '/205q2KznSETw5MeUHupvusQGXDC.jpg',
    'release_date': '1951-11-08',
    'title': 'Quo Vadis',
    'video': False,
    'vote_average': 6.9,
    'vote_count': 188,
    'popularity': 7.141,
    'media_type': 'movie'},
   {'id': 26531,
    'video': False,
    'vote_count': 57,
    'vote_average': 7.1,
    'title': 'The Little Princess',
    'release_date': '1939-03-17',
    'original_language': 'en',
    'original_title': 'The Little Princess',
    'genre_ids': [35, 18, 10751],
    'backdrop_path': '/hH4a4d2xzHmEhaWFX9kqTVuAlR7.jpg',
    'adult': False,
    'overview': 'The classic Shirley Temple film in which a little girl goes in search of her father who is reported missing by the military during the Second Boer War.',
    'poster_path': '/qkg4kKNqh1NScZxjXsg4ORkxOUF.jpg',
    'popularity': 5.288,
    'media_type': 'movie'}],
  'known_for_department': 'Camera',
  'profile_path': None,
  'popularity': 0.6}]

In [160]:
# make the empty database
tmdb_table = pd.DataFrame(index=json_1.keys(),columns=['gender', 'name','id','known_for_department','popularity'])

In [161]:
for v in json_1['nm0005877']:
    print(type(v))
    print(v['gender'])
    print(v['name'])
    print(v['id'])
    print(v['known_for_department'])
    print(v['popularity'])
    tmdb_table.loc['nm0005877']=[v['gender'],v['name'] ,v['id'], v['known_for_department'],v['popularity']]

    
#tmdb_table = tmdb_table.append({'gender': v['gender'],'name':v['name'] ,'id':v['id'], 'known_for_department': v['known_for_department'],'popularity':v['popularity']}, ignore_index=True)

<class 'dict'>
2
William V. Skall
17668
Camera
0.6

In [162]:
for k in json_1.keys():
    for v in json_1[k]:
        v['popularity'] = v.get('popularity', "NaN")
        tmdb_table.loc[k]=[v['gender'],v['name'] ,v['id'], v['known_for_department'],v['popularity']]

In [163]:
tmdb_table[tmdb_table.isna().any(axis=1)].shape

(644, 5)

In [164]:
tmdb_table_trunc = tmdb_table.dropna(axis=0,thresh=2)

In [165]:
tmdb_table_trunc.shape

(9356, 5)

In [166]:
for i in range(10000,90000,10000):
    # substitute the correct number into the name string
    with open("nconsts_dict_J_%s_%s.json"%(i,i+10000), 'r') as nconsts:
        file_x = nconsts.read()
        json_x = json.loads(file_x)
    tmdb_table_x = pd.DataFrame(index=json_x.keys(),columns=['gender', 'name','id','known_for_department','popularity'])
    for k in json_x.keys():
        for v in json_x[k]:
            v['popularity'] = v.get('popularity', "NaN")
            v['known_for_department'] = v.get('known_for_department', "NaN")
            tmdb_table_x.loc[k]=[v['gender'],v['name'] ,v['id'], v['known_for_department'],v['popularity']]
    tmdb_table = tmdb_table.append(tmdb_table_x)

In [169]:
with open("nconsts_dict_J_90000_91881.json", 'r') as nconsts:
    file_x = nconsts.read()
    json_x = json.loads(file_x)
tmdb_table_x = pd.DataFrame(index=json_x.keys(),columns=['gender', 'name','id','known_for_department','popularity'])
for k in json_x.keys():
    for v in json_x[k]:
        v['popularity'] = v.get('popularity', "NaN")
        v['known_for_department'] = v.get('known_for_department', "NaN")
        tmdb_table_x.loc[k]=[v['gender'],v['name'] ,v['id'], v['known_for_department'],v['popularity']]
tmdb_table = tmdb_table.append(tmdb_table_x)

In [170]:
tmdb_table.head()

          gender              name      id known_for_department popularity
nm0005877      2  William V. Skall   17668               Camera        0.6
nm0000073      1    Shirley Temple   95624               Acting      2.119
nm0000859      2  Lionel Barrymore   17753               Acting      1.661
nm0892867      1    Evelyn Venable  117073               Acting      2.372
nm0517099      0        John Lodge  133470               Acting      1.708

In [171]:
tmdb_table.shape

(91881, 5)

In [172]:
print(tmdb_table[tmdb_table.isna().any(axis=1)].shape)
print(tmdb_table[tmdb_table['popularity'].isna()].shape)

(18276, 5)
(18265, 5)

In [173]:
tmdb_table_trunc = tmdb_table.dropna(axis=0,thresh=2)
print(tmdb_table_trunc.shape)

(73616, 5)

In [178]:
tmdb_table_trunc.head()

          gender              name      id known_for_department popularity
nm0005877      2  William V. Skall   17668               Camera        0.6
nm0000073      1    Shirley Temple   95624               Acting      2.119
nm0000859      2  Lionel Barrymore   17753               Acting      1.661
nm0892867      1    Evelyn Venable  117073               Acting      2.372
nm0517099      0        John Lodge  133470               Acting      1.708

In [179]:
tmdb_table_trunc.to_csv('tmdb_people.csv')